---
type: ExternalResourceMatchOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalResourceMatchOptions

`Autodesk.Revit.DB.ExternalResourceMatchOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalResourceMatchOptions | 2015 | `public ExternalResourceMatchOptions ( ExternalResourceType resourceType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ResourceType | 2015 | `public ExternalResourceType ResourceType { get ; }` |